//
//  DataTable.swift
//  BookManangement
//
//  Created by 하고 싶은 걸 하고 살자 on 2023/11/14.
//

import Foundation

class DataTable {
    static let instance = DataTable()
    typealias UserTuple = (age: String, memberId: String, phoneNumber: String, bookRented: String)
    
    var userDataDictionary: [String:Array] = ["김지수" : ["25", "1001", "01012345678", "3"],
                                                  "이민호" : ["32", "1002", "01012345678", "5"],
                                                  "박찬열" : ["28", "1003", "01034567890", "2"],
                                                  "최시원": ["35", "1004", "01045678901", "4"],
                                                  "강슬기" : ["26", "1005", "01056789012", "6"],
                                                  "임윤아" : ["30", "1006", "01067890123", "1"],
                                                  "정호석" : ["27", "1007", "01078901234", "2"],
                                                  "김태형" : ["29", "1008", "01089012345", "2"],
                                                  "송혜교" : ["38", "1009", "01090123456", "5"],
                                                  "전정국" : ["24", "1010", "01001234567", "3"]]
    
    typealias BookTuple = (bookNumber:String, rentalStatus:String, borrower:String)
    
    var bookDataDictionary: [String:Array] = [ "해리포터와 마법사의 돌" : ["B1001", "대여가능","-"], "해리포터와 비밀의 방" : ["B1002","대여중","김지수"], "해리포터와 아즈카반의 죄수" : ["B1003", "대여가능", "-"], "해리포터와 불의 잔" : ["B1004", "대여가능", "-"], "해리포터와 불사조 기사단" : ["B1005", "대여중", "이민호"], "해리포터와 혼혈 왕자" : ["B1006","대여중","박찬열"], "해리포터와 죽음의 성물" : ["B1007", "대여가능", "-"], "반지의 제왕: 반지 원정대" : ["B1008","대여가능","-"], "반지의 제왕: 두 개의 탑" : ["B1009", "대여가능", "-"],
                                               "반지의 제왕: 왕의 귀환": [ "B1010","대여중","최시원"]
     ]
    
    //key
    //bookTitle
    // array
    // 1.memberId 2. bookId, 3.name, 4. RentalDate, 5. Return Date 6. isReturn
    let rentalStateDictionary: [String: [[String]]] = [
        "해리포터와 불의 잔": [
            ["정호석", "1007", "B1004", "2023-10-22", "2023-11-18", "TRUE"],
            ["전정국", "1010", "B1004", "2023-10-06", "2023-10-26", "TRUE"]
        ],
        "해리포터와 아즈카반의 죄수": [
            ["전정국", "1010", "B1003", "2023-11-11", "2023-12-03", "TRUE"]
        ],
        "해리포터와 죽음의 성물": [
            ["이민호", "1002", "B1007", "2023-10-02", "2023-10-08", "TRUE"]
        ],
        "해리포터와 불사조 기사단" : [
            ["최시원", "1004", "B1005", "2023-11-03", "2023-11-12", "TRUE"],
            ["이민호", "1002", "B1005", "2023-10-05", "2023-10-24", "TRUE"]
        ],
        "해리포터와 혼혈 왕자": [
            ["전정국", "1010", "B1006", "2023-10-31", "대여중", "FALSE"],
            ["임윤아", "1006", "B1006", "2023-10-30", "2023-11-10", "TRUE"]
        ],
        "해리포터와 마법사의 돌": [
            ["임윤아", "1006", "B1001", "2023-11-01", "2023-11-07", "TRUE"]
        ],
        "반지의 제왕: 반지 원정대": [
            ["전정국", "1010", "B1008", "2023-10-27", "2023-11-03", "TRUE"],
            ["박찬열", "1003", "B1008", "2023-11-07", "2023-11-28", "TRUE"],
            ["임윤아", "1006", "B1008", "2023-11-14", "대여중", "FALSE"]
        ],
        "반지의 제왕: 왕의 귀환": [
            ["김지수", "1001", "B1010", "2023-10-18", "2023-11-16", "TRUE"],
            ["최시원", "1004", "B1010", "2023-10-28", "2023-11-10", "TRUE"]
        ],
        "해리포터와 비밀의 방": [
            ["전정국", "1010", "B1002", "2023-10-22", "2023-11-21", "TRUE"]
        ]
    ]


}
